# Задача 2: Найдите сумму цифр трехзначного числа.
#
# *Пример:*
#
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0) | abc
num1 = int(input("введите трехзначное число: "))
if (num1 <= 999 and num1 >= 100):
    a = num1 % 10
    b = num1 // 10 % 10
    c = num1 // 100
print(a + b + c)
